{
    "categories": [
      {
        "id": 1,
        "nama": "Kemeja"
      },
      {
        "id": 2,
        "nama": "Dress"
      },
      {
        "id": 3,
        "nama": "Celana"
      },
        {
        "id": 4,
        "nama": "Hoodie"
      }
    ],
    "products": [
      {
        "id": 1,
        "nama": "Relaxed Fit Twill Shirt KHAKI GREEN",
        "harga": 459900,
        "is_ready": true,
        "gambar1": "img/1-1.png",
        "gambar2": "img/1-2.png",
        "gambar3": "img/1-3.png",
        "gambar4": "img/1-4.png",
        "Keterangan": "CONSCIOUS CHOICE Shirt in soft, checked cotton twill with a turn-down collar, classic front and yoke at the back. Long sleeves with buttoned cuffs and a sleeve placket with a link button, open chest pockets and a rounded hem. Relaxed Fit – a straight fit with good room for movement creating a comfortable, relaxed silhouette.",
        "category": {
          "id": 1,
          "nama": "Kemeja"
        }
      },
      {
        "id": 2,
        "nama": "Slim Fit Easy-iron Shirt BLack",
        "harga": 379900,
        "is_ready": true,
        "gambar1": "img/2-1.png",
        "gambar2": "img/2-2.png",
        "gambar3": "img/2-3.png",
        "gambar4": "img/2-4.png",
        "Keterangan": "Shirt in woven fabric with an easy-iron finish. Turn-down collar, classic front and darts and a yoke at the back. Long sleeves with adjustable buttoning at the cuffs and a sleeve placket with a link button. Gently rounded hem. Slim Fit – a fit with narrow shoulders and a tapered waist for a fitted silhouette.",
        "category": {
          "id": 1,
          "nama": "Kemeja"
        }
      },
      {
        "id": 3,
        "nama": "Twill Overshirt",
        "harga": 599900,
        "is_ready": true,
        "gambar1": "img/3-1.png",
        "gambar2": "img/3-2.png",
        "gambar3": "img/3-3.png",
        "gambar4": "img/3-4.png",
        "Keterangan": "Overshirt in twill with a collar, buttons down the front and a yoke at the back. Flap chest pockets with a button, and long sleeves with buttoned cuffs.",
        "category": {
          "id": 1,
          "nama": "Kemeja"
        }
      },
      {
        "id": 4,
        "nama": "Slim Fit Easy-iron Shirt WHITE",
        "harga": 379900,
        "is_ready": true,
        "gambar1": "img/4-1.png",
        "gambar2": "img/4-2.png",
        "gambar3": "img/4-3.png",
        "gambar4": "img/4-4.png",
        "Keterangan": "Shirt in woven fabric with an easy-iron finish. Turn-down collar, classic front and darts and darts and a yoke at the back. Long sleeves with adjustable buttoning at the cuffs and a sleeve placket with a link button. Gently rounded hem. Slim Fit – a fit with narrow shoulders and a tapered waist for a fitted silhouette.",
        "category": {
          "id": 1,
          "nama": "Kemeja"
        }
      },
      {
        "id": 5,
        "nama": "Oxford Shirt Muscle Fit White",
        "harga": 429900,
        "is_ready": true,
        "gambar1": "img/5-1.png",
        "gambar2": "img/5-2.png",
        "gambar3": "img/5-3.png",
        "gambar4": "img/5-4.png",
        "Keterangan": "Shirt in stretch Oxford cotton with a button-down collar, classic front and a yoke and darts at the back. Long sleeves with adjustable buttoning at the cuffs, and a rounded hem. Muscle Fit – a fit designed to showcase the body’s physique with narrow shoulders and tapered sleeves to create a flattering silhouette.",
        "category": {
          "id": 1,
          "nama": "Kemeja"
        }
      },
      {
        "id": 6,
        "nama": "Regular Fit Resort Shirt RICK AND MORTY",
        "harga": 459900,
        "is_ready": true,
        "gambar1": "img/6-1.png",
        "gambar2": "img/6-2.png",
        "gambar3": "img/6-3.png",
        "gambar4": "img/6-4.png",
        "Keterangan": "CONSCIOUS CHOICE Short-sleeved shirt in softly draping, patterned viscose with a resort collar, French front and yoke at the back. Open chest pocket, and a straight-cut hem with a slit in each side.",
        "category": {
          "id": 1,
          "nama": "Kemeja"
        }
      },
      {
        "id": 7,
        "nama": "Relaxed Fit Checked Flannel Shirt",
        "harga": 429900,
        "is_ready": true,
        "gambar1": "img/7-1.png",
        "gambar2": "img/7-2.png",
        "Keterangan": "CONSCIOUS CHOICE Shirt in soft cotton flannel with a turn-down collar, classic front and yoke at the back. Long sleeves with buttoned cuffs and a sleeve placket with a link button, an open chest pocket, and a rounded hem. Relaxed Fit – a straight fit with good room for movement creating a comfortable, relaxed silhouette.",
        "category": {
          "id": 1,
          "nama": "Kemeja"
        }
      },
      {
        "id": 8,
        "nama": "Relaxed Fit Patterned FAST AND FURIOUS",
        "harga": 379900,
        "is_ready": true,
        "gambar1": "img/8-1.png",
        "gambar2": "img/8-2.png",
        "gambar3": "img/8-3.png",
        "gambar4": "img/8-4.png",
        "Keterangan": "CONSCIOUS CHOICE Short-sleeved shirt in a patterned viscose weave with a resort collar, French front and a yoke at the back. Dropped shoulders, a chest pocket and straight-cut hem. Relaxed Fit – a straight fit with good room for movement creating a comfortable, relaxed silhouette.",
        "category": {
          "id": 1,
          "nama": "Kemeja"
        }
      },
      {
        "id": 9,
        "nama": "Relaxed Fit Patterned SPONGEBOB",
        "harga": 379900,
        "is_ready": true,
        "gambar1": "img/9-1.png",
        "gambar2": "img/9-2.png",
        "gambar3": "img/9-3.png",
        "gambar4": "img/9-4.png",
        "Keterangan": "OCONSCIOUS CHOICE Short-sleeved shirt in a patterned viscose weave with a resort collar, French front and a yoke at the back. Dropped shoulders, a chest pocket and straight-cut hem. Relaxed Fit – a straight fit with good room for movement creating a comfortable, relaxed silhouette.",
        "category": {
          "id": 1,
          "nama": "Kemeja"
        }
      },
      {
        "id": 10,
        "nama": "Regular Fit Resort Shirt",
        "harga": 429900,
        "is_ready": true,
        "gambar1": "img/10-1.png",
        "gambar2": "img/10-2.png",
        "Keterangan": "Short-sleeved shirt in a lyocell and cotton weave with a resort collar, French front and chest pocket. Yoke with darts at the back, and a straight-cut hem with a slit in each side. Regular Fit – a classic fit with good room for movement and a gently tapered waist to create a comfortable, tailored silhouette.",
        "category": {
          "id": 1,
          "nama": "Kemeja"
        }
      },
      {
        "id": 11,
        "nama": "Regular Fit Printed Sesama Street Shirt",
        "harga": 379900,
        "is_ready": true,
        "gambar1": "img/11-1.png",
        "gambar2": "img/11-2.png",
        "Keterangan": "CONSCIOUS Short-sleeved shirt in a printed viscose weave with a resort collar, French front and yoke at the back. Open chest pocket and a straight-cut hem. Regular Fit – a classic fit with good room for movement and a gently tapered waist to create a comfortable.",
        "category": {
          "id": 1,
          "nama": "Kemeja"
        }
      },
      {
        "id": 12,
        "nama": "Regular Fit Linen-blend Shirt",
        "harga": 599900,
        "is_ready": true,
        "gambar1": "img/12-1.png",
        "gambar2": "img/12-2.png",
        "gambar3": "img/12-3.png",
        "gambar4": "img/12-4.png",
        "Keterangan": "CONSCIOUS CHOICE Regular-fit shirt in a linen and cotton weave with a turn-down collar, French front and a yoke at the back. Open chest pocket and long sleeves with adjustable buttoning at the cuffs and a sleeve placket with a link button. Rounded hem.",
        "category": {
          "id": 1,
          "nama": "Kemeja"
        }
      },
      {
        "id": 13,
        "nama": "Airy Dress",
        "harga": 399900,
        "is_ready": true,
        "gambar1": "img/13-1.png",
        "gambar2": "img/13-2.png",
        "gambar3": "img/13-3.png",
        "gambar4": "img/13-4.png",
        "Keterangan": "Short dress in an airy weave made from a viscose blend. Wide, gathered neckline, 3/4-length sleeves with narrow elastication at the cuffs, and a gathered seam at the hem for added width. Unlined.",
        "category": {
          "id": 2,
          "nama": "Dress"
        }
      },
      {
        "id": 14,
        "nama": "Long Chiffon Dress",
        "harga": 549900,
        "is_ready": true,
        "gambar1": "img/14-1.png",
        "gambar2": "img/14-2.png",
        "gambar3": "img/14-3.png",
        "gambar4": "img/14-4.png",
        "Keterangan": "CONSCIOUS CHOICE Long, gently flared dress in airy chiffon with a small, frilled collar, a V-shaped opening at the front with long ties and a gathered yoke front and back for a gentle draped effect. Long, wide, cuffed sleeves, and a gathered seam at the knees for added width. Sleeveless jersey underdress.",
        "category": {
          "id": 2,
          "nama": "Dress"
        }
      },
      {
        "id": 15,
        "nama": "Jacquard-weave Dress",
        "harga": 699900,
        "is_ready": true,
        "gambar1": "img/15-1.png",
        "gambar2": "img/15-2.png",
        "gambar3": "img/15-3.png",
        "gambar4": "img/15-4.png",
        "Keterangan": "CONSCIOUS Calf-length, straight-cut dress in jacquard-weave viscose with a slight sheen. Collar, covered buttons down the front, dropped shoulders and long sleeves. Pleat at the back for added width. Unlined.",
        "category": {
          "id": 2,
          "nama": "Dress"
        }
      },
      {
        "id": 16,
        "nama": "Shirt Dress",
        "harga": 399900,
        "is_ready": true,
        "gambar1": "img/16-1.png",
        "gambar2": "img/16-2.png",
        "gambar3": "img/16-3.png",
        "gambar4": "img/16-4.png",
        "Keterangan": "Calf-length dress in woven fabric with a collar and buttons down the front. Relaxed fit with dropped shoulders, long sleeves, wide cuffs with slits, and a rounded hem. Unlined.",
        "category": {
          "id": 2,
          "nama": "Dress"
        }
      },
      {
        "id": 17,
        "nama": "Wrap Dress",
        "harga": 429900,
        "is_ready": true,
        "gambar1": "img/17-1.png",
        "gambar2": "img/17-2.png",
        "gambar3": "img/17-3.png",
        "gambar4": "img/17-4.png",
        "Keterangan": "CONSCIOUS CHOICE Short-sleeved, knee-length dress in a softly draping viscose weave with a V-neck and wrapover front with narrow ties at the side. Unlined.",
        "category": {
          "id": 2,
          "nama": "Dress"
        }
      },
      {
        "id": 18,
        "nama": "Cotton Dress",
        "harga": 259900,
        "is_ready": true,
        "gambar1": "img/18-1.png",
        "gambar2": "img/18-2.png",
        "Keterangan": "Short, flared dress in an airy cotton weave with adjustable spaghetti shoulder straps and two elasticated seams with a small frill trim at the top.",
        "category": {
          "id": 2,
          "nama": "Dress"
        }
      },
      {
        "id": 19,
        "nama": "Tie-belt Satin Dress",
        "harga": 699900,
        "is_ready": true,
        "gambar1": "img/19-1.png",
        "gambar2": "img/19-2.png",
        "Keterangan": "SCONSCIOUS CHOICE Calf-length dress in softly draping satin with a deep V-neck and a wrapover at the top of the front. Concealed zip in one side, 3/4-length, cuffed puff sleeves, and a seam with a wide tie belt at the waist. Unlined.",
        "category": {
          "id": 2,
          "nama": "Dress"
        }
      },
      {
        "id": 20,
        "nama": "Ribbed Dress",
        "harga": 429900,
        "is_ready": true,
        "gambar": "",
        "Keterangan": "CONSCIOUS Fitted, calf-length dress in a fine rib knit containing some wool. Round neck, wide shoulder straps and a slit at the front. Unlined.",
        "category": {
          "id": 2,
          "nama": "Dress"
        }
      },
      {
        "id": 21,
        "nama": "Balloon-sleeved Satin Dress",
        "harga": 479900,
        "is_ready": true,
        "gambar": "",
        "Keterangan": "Short dress in softly draped satin with a V-neck, tie belt around the waist and long balloon sleeves with buttoned cuffs. Unlined.",
        "category": {
          "id": 2,
          "nama": "Dress"
        }
      },
      {
        "id": 22,
        "nama": "Straight High Jeans",
        "harga": 549900,
        "is_ready": true,
        "gambar": "",
        "Keterangan": "CONSCIOUS CHOICE 5-pocket jeans in washed, sturdy cotton denim with hard-worn details. High waist, a button fly and straight legs to create the perfect 90s vibe.",
        "category": {
          "id": 3,
          "nama": "Celana"
        }
      },
      {
        "id": 23,
        "nama": "90s Baggy High Waist Jeans",
        "harga": 399900,
        "is_ready": true,
        "gambar": "",
        "Keterangan": "Denim jeans in a loose fit with a high waist, zip fly and button, low crotch and wide, extra-long legs. Diagonal side pockets, back pockets and flap leg pockets.",
        "category": {
          "id": 3,
          "nama": "Celana"
        }
      },
      {
        "id": 24,
        "nama": "Skinny High Jeans",
        "harga": 429900,
        "is_ready": true,
        "gambar": "",
        "Keterangan": "Jeans in slightly stretchy denim with a high waist, zip fly and button, fake front pockets, a real coin pocket, real back pockets and skinny legs.",
        "category": {
          "id": 3,
          "nama": "Celana"
        }
      },
      {
        "id": 25,
        "nama": "Regular Jeans",
        "harga": 399900,
        "is_ready": true,
        "gambar": "",
        "Keterangan": "CONSCIOUS CHOICE 5-pocket jeans in stretch cotton denim with a regular waist, zip fly and button and straight legs with good room for movement over the thighs and knees.",
        "category": {
          "id": 3,
          "nama": "Celana"
        }
      },
      {
        "id": 26,
        "nama": "Hybrid Regular Denim Joggers",
        "harga": 599900,
        "is_ready": true,
        "gambar": "",
        "Keterangan": "5-pocket joggers in stretch denim made from a cotton blend. Regular waist with elastication at the back, a concealed drawstring and a zip fly with a button. Straight legs with good room for movement over the thighs and knees. Made using Lycra® Hybrid Technology for exceptional softness and comfort without compromising the authentic denim look.",
        "category": {
          "id": 3,
          "nama": "Celana"
        }
      },
      {
        "id": 27,
        "nama": "Running Shorts",
        "harga": 459900,
        "is_ready": true,
        "gambar": "",
        "Keterangan": "Shorts in fast-drying functional fabric designed to help keep you dry and cool while running. Elastication and a concealed drawstring at the waist, zipped side pockets and ventilating mesh at the crotch for increased ventilation. Legs with reflective details for increased visibility outdoors and a slit in one side of the hems. Soft mesh inner shorts.",
        "category": {
          "id": 3,
          "nama": "Celana"
        }
      },
      {
        "id": 28,
        "nama": "Slim Fit Sports Joggers",
        "harga": 599900,
        "is_ready": true,
        "gambar": "",
        "Keterangan": "CONSCIOUS CHOICE Jersey joggers for indoor and outdoor workouts. Covered elastication and a drawstring at the waist, zipped side pockets for safe storage of valuables and a mesh panel at the crotch for increased air permeability. Cuffed hems.",
        "category": {
          "id": 3,
          "nama": "Celana"
        }
      },
       {
        "id": 29,
        "nama": "Relaxed Fit Zip-through Hoodie",
        "harga": 459900,
        "is_ready": true,
        "gambar": "",
        "Keterangan": "Zip-through hoodie in sweatshirt fabric. Relaxed fit with a jersey-lined, drawstring hood, a zip down the front, diagonal, welt side pockets and ribbing at the cuffs and hem. Soft brushed inside.",
        "category": {
          "id": 4,
          "nama": "Hoodie"
        }
      },
        {
        "id": 30,
        "nama": "Relaxed Fit Hoodie",
        "harga": 429900,
        "is_ready": true,
        "gambar": "",
        "Keterangan": "ESSENTIALS Hoodie in sweatshirt fabric made from a cotton blend. Relaxed fit with a jersey-lined, drawstring hood, a kangaroo pocket, long sleeves and wide ribbing at the cuffs and hem. Soft brushed inside.",
        "category": {
          "id": 4,
          "nama": "Hoodie"
        }
      },
        {
        "id": 31,
        "nama": "Relaxed Fit Hoodie STRANGER THINGS",
        "harga": 699900,
        "is_ready": true,
        "gambar": "",
        "Keterangan": "Hoodie in sweatshirt fabric made from a cotton blend. Relaxed fit with a lined hood, kangaroo pocket, dropped shoulders, long sleeves and ribbing at the cuffs and hem. Soft brushed inside.",
        "category": {
          "id": 4,
          "nama": "Hoodie"
        }
      },
        {
        "id": 32,
        "nama": "Slim Fit Sports Joggers",
        "harga": 599900,
        "is_ready": true,
        "gambar": "",
        "Keterangan": "CONSCIOUS CHOICE Jersey joggers for indoor and outdoor workouts. Covered elastication and a drawstring at the waist, zipped side pockets for safe storage of valuables and a mesh panel at the crotch for increased air permeability. Cuffed hems.",
        "category": {
          "id": 3,
          "nama": "Celana"
        }
      },
        {
        "id": 33,
        "nama": "Relaxed Fit Motif-detail Hoodie KEITH HARING",
        "harga": 549900,
        "is_ready": true,
        "gambar": "",
        "Keterangan": "SMILEY® X H&M Hoodie in sweatshirt fabric with a motif front and back and a soft brushed inside. Relaxed fit with a lined, wrapover hood, kangaroo pocket, dropped shoulders, long sleeves and ribbing at the cuffs and hem.",
        "category": {
          "id": 3,
          "nama": "Celana"
        }
      }
    ],
    "keranjangs": [
      
    ],
    "pesanans": [
      
        ],
  }
